Data Manipulation and analysis with pandas

Data manipulation and analysis are key tasks in any data science or data analysis project. pandas provides a wide range of functions for data manipulation and analysis, making it easier to clean,transform, and extract insights from data. In this lesson, we will cover various data manipulation ad analysis techniques using pandas.

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("students.csv")

In [3]:
df

   StudentID      Name  Age
0          1  Pranjali   21
1          2   Anamika   23
2          3     Talat   21
3          4      Yami   20
4          5   Chetana   22